{
  "id": "welcome-to-play-visualization",
  "title": "Visualization Examples (JSON)",
  "blocks": [
    {
      "type": "markdown",
      "content": "# Visualization Examples 📊\n\nWelcome to Grafana's comprehensive visualization showcase! This dashboard demonstrates the incredible variety of visualization types available in Grafana. Whether you're tracking metrics, analyzing trends, or presenting data insights, Grafana has the perfect visualization for your needs.\n\nFrom traditional charts to advanced geospatial visualizations, you'll discover how to transform raw data into meaningful visual stories."
    },
    {
      "type": "markdown",
      "content": "## 🌍 Geographic Data with Geomap\n\nGeomaps bring your location-based data to life, perfect for tracking global services, user distribution, or infrastructure across regions."
    },
    {
      "type": "section",
      "id": "geomap-viz",
      "title": "Geographic Data with Geomap",
      "blocks": [
        {
          "type": "interactive",
          "action": "highlight",
          "reftarget": "a[href*=\"/d/panel-geomap/geomap-examples\"]",
          "tooltip": "The **Geomap visualization** displays data on interactive maps using various layers like markers, heatmaps, and routes. It's perfect for visualizing geographic distributions, tracking service health across regions, monitoring IoT devices by location, or analyzing user traffic patterns. Geomap supports multiple map layers including OpenStreetMap, CARTO, and custom tile servers, and can display data as circles, heatmaps, or custom markers with dynamic sizing and coloring based on metric values.",
          "content": "Explore the **Geomap** visualization for geographic and location-based data."
        }
      ]
    },
    {
      "type": "markdown",
      "content": "## 🔥 Performance Analysis with Flame Graphs\n\nFlame graphs are essential for performance profiling, helping you identify bottlenecks and optimize system performance at a glance."
    },
    {
      "type": "section",
      "id": "flame-graphs-viz",
      "title": "Performance Analysis with Flame Graphs",
      "blocks": [
        {
          "type": "interactive",
          "action": "highlight",
          "reftarget": "a[href*=\"/d/cdl34qv4zzg8wa/flame-graphs\"]",
          "completeEarly": true,
          "tooltip": "The **Flame Graph visualization** is a powerful tool for profiling and performance analysis. It displays hierarchical data where the width of each block represents the amount of time or resources consumed. This visualization is particularly valuable for analyzing CPU profiles, memory allocations, and call stacks. Each level represents a stack frame, and you can quickly identify performance hotspots by looking for wide blocks. Flame graphs are interactive - you can click to zoom into specific code paths and hover for detailed metrics.",
          "content": "Discover **Flame Graphs** for profiling and performance optimization."
        }
      ]
    },
    {
      "type": "markdown",
      "content": "## 🎨 Creative Layouts with Canvas\n\nCanvas visualizations give you complete creative freedom to design custom layouts and interactive dashboards beyond traditional panel constraints."
    },
    {
      "type": "section",
      "id": "canvas-viz",
      "title": "Creative Layouts with Canvas",
      "blocks": [
        {
          "type": "interactive",
          "action": "highlight",
          "reftarget": "a[href*=\"/d/c9ea65f5-ed5a-45cf-8fb7-f82af7c3afdf/canvas-visualization\"]",
          "completeEarly": true,
          "tooltip": "The **Canvas visualization** provides a free-form design surface where you can arrange elements exactly as you envision them. Unlike traditional panels constrained to a grid, Canvas lets you place text, images, shapes, metrics, and icons anywhere on the canvas. It's perfect for creating custom dashboards like network topology diagrams, process flow visualizations, building floor plans with sensor overlays, or branded executive dashboards. You can layer elements, use background images, and create truly unique data presentations that match your specific needs.",
          "content": "Check out the **Canvas** visualization for custom, free-form dashboard designs."
        }
      ]
    },
    {
      "type": "markdown",
      "content": "## 📈 Time-Based Analysis with Time Series\n\nTime series graphs are the foundation of observability, showing how your metrics evolve over time with rich customization options."
    },
    {
      "type": "section",
      "id": "time-series-viz",
      "title": "Time-Based Analysis with Time Series",
      "blocks": [
        {
          "type": "interactive",
          "action": "highlight",
          "reftarget": "a[href*=\"/d/000000016/time-series-graphs\"]",
          "completeEarly": true,
          "tooltip": "The **Time Series visualization** is Grafana's most versatile and widely-used graph type. It displays data points over time with support for multiple series, various drawing modes (lines, bars, points), and advanced features like thresholds, annotations, and custom axes. Time series graphs excel at showing trends, patterns, and anomalies in metrics data. You can customize line styles, fill opacity, stack series, apply transforms, and use features like value mappings and overrides to highlight important data. It's the go-to visualization for monitoring system metrics, application performance, business KPIs, and any time-based data.",
          "content": "Explore **Time Series** visualizations for trend analysis and monitoring."
        }
      ]
    },
    {
      "type": "markdown",
      "content": "## 📊 More Visualization Types\n\nBeyond these featured visualizations, this dashboard showcases many more options:\n\n- **Bar Charts & Pie Charts** - Perfect for comparing categories and showing proportions\n- **Candlestick Charts** - Essential for financial data and price analysis\n- **Alert Lists** - Monitor your system's health with aggregated alerts\n- **Heatmaps** - Visualize density and patterns across two dimensions\n- **Tables** - Display structured data with sorting and filtering\n- **Stat Panels** - Highlight single metrics with sparklines and thresholds\n- **Gauges** - Show metrics as traditional gauge displays\n- **State Timeline** - Track state changes over time\n- **And many more!** - Grafana continues to expand its visualization library"
    },
    {
      "type": "markdown",
      "content": "## 🎯 Choosing the Right Visualization\n\nSelecting the appropriate visualization is key to effective data communication:\n\n- **Trends over time?** Use Time Series or State Timeline\n- **Geographic data?** Geomap is your friend\n- **Performance profiling?** Flame Graphs reveal bottlenecks\n- **Category comparison?** Bar Charts and Pie Charts work great\n- **Single metric focus?** Stat panels or Gauges stand out\n- **Custom layouts?** Canvas gives you complete freedom\n- **Financial data?** Candlestick charts are purpose-built\n- **Density patterns?** Heatmaps show distributions beautifully"
    },
    {
      "type": "markdown",
      "content": "## 💡 Best Practices\n\n- **Match the viz to the data** - Don't force a pie chart when a time series makes more sense\n- **Use color purposefully** - Colors should communicate meaning, not just decoration\n- **Label clearly** - Ensure axes, legends, and tooltips are informative\n- **Consider your audience** - Technical teams may prefer detailed graphs; executives might want simplified views\n- **Test interactivity** - Make sure tooltips, legends, and drill-downs work as expected\n- **Optimize performance** - Some visualizations are more resource-intensive than others"
    },
    {
      "type": "markdown",
      "content": "## 🚀 Next Steps\n\nNow that you've explored these visualization types, try:\n\n- Creating your own dashboard with multiple visualization types\n- Experimenting with different data sources\n- Customizing colors, thresholds, and display options\n- Setting up transformations to reshape your data\n- Exploring the other interactive tutorials for deeper features\n\n**Remember:** The best visualization is the one that makes your data's story clear and actionable! 📊✨"
    }
  ]
}

