{
  "id": "adaptive-logs-recommendations",
  "title": "Adaptive Logs ",
  "blocks": [
    {
      "type": "markdown",
      "content": "# Reduce log volume using Adaptive Logs recommendations\n\nUse this interactive guide to learn how **Adaptive Logs** helps you reduce log volume safely by identifying low-value or rarely used logs. You’ll explore where Adaptive Logs lives in Grafana Cloud, review how recommendations are generated, and understand your options for reviewing, filtering, editing, locking, or applying drop-rate recommendations."
    },
    {
      "type": "section",
      "blocks": [
        {
          "type": "interactive",
          "action": "highlight",
          "reftarget": "a[data-testid='data-testid Nav menu item'][href='adaptive-telemetry']",
          "content": "Adaptive Logs is part of Adaptive Telemetry. Start by opening **Adaptive Telemetry** to see where Grafana Cloud helps you optimize metrics, logs, and traces based on real usage.",
          "requirements": [
            "navmenu-open"
          ],
          "doIt": false
        },
        {
          "type": "interactive",
          "action": "highlight",
          "reftarget": "a[data-testid='data-testid Nav menu item'][href='/a/grafana-adaptivelogs-app/overview']",
          "content": "Select **Adaptive Logs** to open log optimization recommendations. Adaptive Logs analyzes your log ingest and query behavior to find opportunities to reduce noise and cost without losing useful signal.",
          "requirements": [
            "navmenu-open"
          ],
          "doIt": true
        },
        {
          "type": "interactive",
          "action": "highlight",
          "reftarget": "a[data-testid='data-testid Tab Patterns']",
          "content": "Open the **Patterns** tab to review detected log patterns and drop-rate recommendations. This is where you’ll spend most of your time reviewing, filtering, and deciding which recommendations to apply.",
          "requirements": [
            "navmenu-open"
          ],
          "doIt": false
        }
      ],
      "id": "open-adaptive-logs",
      "title": "Get oriented with Adaptive Logs"
    },
    {
      "type": "section",
      "blocks": [
        {
          "type": "interactive",
          "action": "highlight",
          "reftarget": "input[data-testid='pattern-filter']",
          "content": "Use filters to narrow the list of patterns before taking action. Filtering by service, query frequency, or volume helps you focus on the logs that matter most to your current goal.",
          "requirements": [
            "exists-reftarget",
            "navmenu-open"
          ],
          "doIt": false
        },
        {
          "type": "markdown",
          "content": "Filtering patterns is especially useful when you want to start with a single service or team or you want to prioritize the highest-volume or least-queried logs. You’re reviewing recommendations gradually instead of applying them all at once."
        },
        {
          "type": "markdown",
          "content": "Each row represents a detected log pattern. Here you can review how often logs matching a pattern are queried, how much volume they generate, and the **recommended drop rate** based on actual usage."
        },
        {
          "type": "interactive",
          "action": "highlight",
          "reftarget": "button:contains(\"Apply all recommendations\")",
          "content": "Apply all recommendations to realize immediate cost savings. This is the fastest way to reduce log volume using Adaptive Logs. You can still filter, edit, or lock individual patterns later if needed.",
          "requirements": [
            "exists-reftarget"
          ],
          "doIt": false
        },
        {
          "type": "markdown",
          "content": "Applying recommendations only affects **new logs going forward**, previously ingested logs are never removed. If you prefer more control, you can review patterns in detail, adjust individual drop rates, or lock specific patterns before applying changes."
        }
      ],
      "id": "review-recommendations",
      "title": "Review and apply recommendations"
    },
    {
      "type": "section",
      "blocks": [
        {
          "type": "interactive",
          "action": "highlight",
          "reftarget": "label[aria-label^='Show early detection patterns']",
          "content": "Enable **Show early detection patterns** to see newly detected log patterns sooner. Use this when you want to react quickly to new ingest spikes or noisy logs before Adaptive Logs has enough data to generate a recommendation.",
          "requirements": [
            "exists-reftarget"
          ],
          "doIt": false
        },
        {
          "type": "markdown",
          "content": "Early detection patterns appear as soon as they are detected, without a recommended drop rate. Because Adaptive Logs hasn’t yet collected enough usage data, these patterns require manual review and are best used for early investigation."
        },
        {
          "type": "interactive",
          "action": "noop",
          "content": "Edit a recommendation to adjust the drop rate for an individual pattern. Use this when you want to be more conservative, test changes gradually, or fine-tune recommendations for specific services. Locking a pattern is also done from this edit view.\n\nWhen editing a recommendation, you can enter a custom drop rate, rview projected savings before applying changes, lock the pattern to prevent future bulk updates from changing it. Locking is useful when a pattern has been carefully reviewed or must remain stable, even when applying recommendations in bulk. All drop rate changes, locked or unlocked, only affect new logs going forward."
        }
      ],
      "id": "investigate-finetune",
      "title": "Investigate and fine-tune recommendations"
    },
    {
      "type": "markdown",
      "content": "**Congratulations!** You now know where to find Adaptive Logs recommendations and the different ways you can review, filter, edit, lock, and apply them to reduce log volume safely. You’re ready to continue optimizing your logs with more control and confidence."
    }
  ]
}
