{
  "id": "introduction-to-tracing-lab2-basic-search",
  "title": "2.1 Basic Search",
  "blocks": [
    {
      "type": "markdown",
      "content": "# 2.1 Basic Search\n\n## Grafana Explore\n\nFor the majority of the labs in this breakout session, you'll be using the Grafana Explorer along with the pre-provisioned Grafana Cloud Traces (Tempo) data source."
    },
    {
      "type": "markdown",
      "content": "**1.** Select the 'Grafana Explore' menu option from the left-hand menu bar."
    },
    {
      "type": "image",
      "src": "img/1-grafana-explore.png",
      "alt": "Grafana Explore"
    },
    {
      "type": "markdown",
      "content": "**2.** In the data sources list type `traces`, then select the Tempo data source (it will be named similarly to `grafanacloud-abcdef-traces`)."
    },
    {
      "type": "image",
      "src": "img/1-tempo-datasource.png",
      "alt": "Tempo datasource selection"
    },
    {
      "type": "markdown",
      "content": "## A Basic search query\n\nWhilst Traces Drilldown can be used for a NoQL experience, and TraceQL is used for more detailed querying, there's actually another way to find traces in Grafana.\n\nThe basic `Search` tool allows you to provide basic query criteria either by editing the criteria manually, or by using a set of dropdown lists that have been pre-populated with appropriate values."
    },
    {
      "type": "markdown",
      "content": "**1.** Select the `Search` Query type in the Tempo data source query options.\n\n\n**2.** In the `Service Name` field, either select `productcatalogservice` from the dropdown list for the name value, or enter the text manually.\n\n\n**3.** In the `Status` field, select the `error` option from the dropdown list.\n\n\n**4.** Finally, select `Run query` from the top right. You can leave the time window as it is at `Last 1 hour`.\n\nThe Tempo data source (in this case, Grafana Cloud Traces) will return a list of traces that match, ie. traces where at least one span belongs to the `productcatalogservice` and has an `error` status set on it."
    },
    {
      "type": "image",
      "src": "img/1-datasource-query-type.png",
      "alt": "Data source query type"
    },
    {
      "type": "markdown",
      "content": "You should notice that as you've selected fields for the search, a line under the selection fields actually contains the TraceQL equivalent of what you've just selected:\n\n```\n{resource.service.name=\"productcatalogservice\" && status=error}\n```\n\nThis is because the search functionality is actually built on top of TraceQL, but allow you to build up a query without knowing the language. Before Traces Drilldown, this was the default way for beginners to search for traces of interest.\n\nBasic searches allow you to find traces quickly without writing any TraceQL, but are limited to service name, span name, span status, span duration and span attributes (tags), but will not allow you to carry out TraceQL metrics queries."
    },
    {
      "type": "markdown",
      "content": "## Visualising a trace\n\nMuch in the same way you looked at traces in Traces Drilldown, the returned list of matching traces includes a number of spans that matched the span selection criteria."
    },
    {
      "type": "markdown",
      "content": "**1.** Take the first result in the list, and select the `>` icon to the left to expand the spans within the trace.\n\n\n**2.** Select the first `Span ID` in the list.\n\n\n**3.** This will lead to Grafana Explore splitting the tab and showing you the list of matched traces, as well as the trace for the span you selected (which will be highlighted in the trace visualisation).\n\n\n**4.** Expand the span in the trace by selecting it, and then expand the `Span attributes` and `Events` lists."
    },
    {
      "type": "image",
      "src": "img/1-selected-span.png",
      "alt": "Selected span in trace"
    },
    {
      "type": "markdown",
      "content": "Note that the span includes the error set via the error icon, as well as an error message saying why the span has an error set. In this case, it's `pq: sorry, too many clients already`, which tells us that the service was not able to allocate more database handles for a request."
    },
    {
      "type": "image",
      "src": "img/1-error-icon.png",
      "alt": "error icon"
    },
    {
      "type": "markdown",
      "content": "## Moving to TraceQL\n\nFinally, close the right-hand panel showing the trace, then select the `Edit in TraceQL` button. Alternatively, if you select the TraceQL option for the Query type, Grafana will recognize that you've switched from the basic search and prompt you to copy the query you've already created. Clicking the Copy query from Search button is another excellent way to begin if you'd like to build more advanced queries after starting with a basic search."
    },
    {
      "type": "image",
      "src": "img/1-basic-to-traceql.png",
      "alt": "Basic search carried over in TraceQL"
    },
    {
      "type": "markdown",
      "content": "## Summary\n\nYou've learnt how to carry out a basic TraceQL query from within Grafana, without actually having to write any TraceQL! However, whilst this is useful for quickly finding basic traces, crafting a TraceQL query will allow you to pinpoint a set of traces that are far more interesting.\n\nIn the next lab, we'll start from a basic TraceQL query and then build it up to find specific characteristics of traces we want to observe."
    }
  ]
}
