{
  "id": "determine-collector-configured-fleet-management",
  "title": "Determine if a collector is configured for Fleet Management",
  "blocks": [
    {
      "type": "markdown",
      "content": "Grafana Fleet Management is a Grafana Cloud feature that enables you to manage collector deployments at scale.\n\n**Streamlined configuration management**.\nWith a central control hub, you can easily manage configurations across all collectors.\nCreate, activate, deactivate, or adjust configuration pipelines remotely without complex scripts or time-consuming change management processes, all from the Grafana Cloud interface.\n\n**Centralized health monitoring**.\nYou have complete visibility into the health of your collector fleet.\nView out-of-the-box dashboards that track metrics for component health, system resources, and deployment infrastructure.\nConnect erroring collectors with faulty configuration without leaving the application.\nTroubleshoot more efficiently and identify issues with individual collectors more quickly.\n\n**Cost and collection control**.\nTailor data collection pipelines to match specific use cases and ensure observability data stays focused on what's most important.\nTurn data streams on and off as needed to optimize your costs and reduce data overload."
    },
    { "type": "video",
      "provider": "youtube",
      "title": "Determine if collector configured",
      "src": "https://www.youtube.com/embed/PrjTxzc27Ns",
      "start": 130,
      "end": 165
    },
    {
      "type": "markdown",
      "content": "A Grafana Alloy instance is installed whenever you install:\n- A Grafana Cloud integration\n- Kubernetes Monitoring\n- Cloud Provider Observability\n- Application Observability\n\n"
    },
    { "type": "markdown",
      "content": "The registration of a Grafana Alloy collector in Fleet Management depends on the **Enable Remote Configuration** toggle shown during Alloy installation. By default, this toggle is enabled, so Grafana Alloy is registered as part of your fleet. If you disable the toggle during installation, or if Alloy was installed before the Fleet Management feature was released, the collector will not be registered in Fleet Management.\n\nThe following image shows the **Enable Remote Configuration** toggle that appears during Alloy installation."
    },
    {
      "alt": "Image shows Enable Remote Configuration toggle",
      "height": 126,
      "src": "https://grafana.com/media/docs/learning-journey/fleet-mgt/flt-mgt-toggle.png",
      "type": "image",
      "width": 600
    },
    {
      "type": "markdown",
      "content": "To determine if a collector is registered with Fleet Management, complete the following steps:"
    },
    {
      "type": "section",
      "blocks": [
        {
          "type": "conditional",
          "conditions": ["renderer:website"],
          "description": "Instruct user to sign into Grafana Cloud but only on the website.",
          "whenTrue": [
            {
              "type": "markdown",
              "content": "Sign in to your Grafana Cloud environment, for example `mystack.grafana.net`."
            }
          ],
          "whenFalse": []
        },
        {
          "type": "interactive",
          "action": "highlight",
          "reftarget": "a[data-testid='data-testid Nav menu item'][href='/a/grafana-collector-app/fleet-management']",
          "requirements": ["navmenu-open", "exists-reftarget"],
          "content": "Navigate to **Connections > Collector > Fleet Management**."
        }
      ]
    },
    {
      "type": "markdown",
      "content": "If your collector doesn't appear on the list, you can manually add it. Continue to the next milestone to learn how to register a Grafana Alloy instance with Fleet Management."
    }
  ]
}
