{
  "id": "connect-prometheus-metrics",
  "title": "Connect Prometheus metrics to Grafana Cloud",
  "blocks": [
    {
      "type": "markdown",
      "content": "Use this interactive guide to learn how to connect **Prometheus metrics** to Grafana Cloud. You'll explore where connections live in Grafana Cloud, search for and select Hosted Prometheus from the catalog, and review the configuration information needed to set up remote write.\n\nThis guide helps you get oriented and understand the setup process, without requiring existing infrastructure or completing the connection."
    },
    {
      "type": "interactive",
      "action": "highlight",
      "reftarget": "a[data-testid='data-testid Nav menu item'][href='/connections']",
      "content": "Open Connections to set up Prometheus metrics.\n\nThis is where you add and manage data sources in Grafana Cloud.",
      "requirements": [
        "navmenu-open"
      ]
    },
    {
      "type": "interactive",
      "action": "highlight",
      "reftarget": "a[data-testid='data-testid Nav menu item'][href='/connections/add-new-connection']",
      "content": "To connect Prometheus metrics, start by adding a new connection.\n\nThis opens the catalog where you can find Hosted Prometheus and other data source types.",
      "requirements": [
        "navmenu-open"
      ]
    },
    {
      "type": "interactive",
      "action": "highlight",
      "reftarget": "input[data-testid='search-input-input']",
      "content": "Use the search field to quickly find a specific data source.\n\nType **Hosted Prometheus** to filter the catalog and locate the Hosted Prometheus connection.",
      "requirements": [
        "on-page:/connections/add-new-connection"
      ],
      "doIt": false
    },
    {
      "type": "interactive",
      "action": "highlight",
      "reftarget": "a[href='/connections/add-new-connection/hosted-prometheus']",
      "content": "Click the **Hosted Prometheus** tile to open the setup page.\n\nThis connection type is used for sending metrics from your own Prometheus instance to Grafana Cloud's managed Prometheus service.",
      "requirements": [
        "on-page:/connections/add-new-connection"
      ]
    },
    {
      "type": "markdown",
      "content": "This page explains how to configure Prometheus remote write to send metrics to Grafana Cloud.\n\nChoose a forwarding method (Grafana Alloy or local Prometheus server), install or configure components, generate an access token, and apply the configuration.\n\nYou do not need to complete the setup now. This step shows the information required to connect your Prometheus metrics."
    },
    {
      "type": "markdown",
      "content": "You now know where connections live in Grafana Cloud, how to find Hosted Prometheus in the catalog, and what information you need to complete setup.\n\nTo connect your metrics, return to this page and follow the configuration steps."
    }
  ]
}