{
  "id": "linux-server-integration-understand-dashboards",
  "title": "About Linux server integration pre-built dashboards",
  "blocks": [
    {
      "type": "markdown",
      "content": "The Linux server integration provides a variety of pre-built dashboards that you can use right away to begin troubleshooting issues. In this step of the journey, you'll become familiar with these pre-built dashboards and learn how to use them to address various problems."
    },
    {
      "type": "markdown",
      "content": "While this journey only focuses on configuring the Linux server integration on one machine, the following dashboard images shows the kinds of data you'll see when you monitor multiple machines.\n\n> **Did you know?** If you don't see any logs or metrics, try switching the data source using the drop-down at the top of the dashboard."
    },
    {
      "type": "markdown",
      "content": "## Linux node/overview dashboard\n\nThis dashboard offers a comprehensive overview of the system, including:\n\n- Metadata: Displays information such as the kernel version, OS release, uptime, and more.\n- CPU utilization: Displays the current usage of the CPU.\n- Memory utilization: Shows how much memory is being used.\n- Disk utilization: Indicates the usage level of disk space.\n- Network utilization: Provides information about network usage.\n\n**Use this dashboard to:**\n\n- Gain a high-level understanding of the operational status of your system."
    },
    {
      "type": "image",
      "src": "/media/docs/learning-journey/linux/node-overview.png",
      "alt": "Example Linux node overview dashboard"
    },
    {
      "type": "markdown",
      "content": "## Linux node/CPU and system dashboard\n\nThis dashboard shows information about the CPU and the system clock.\n\n**Use this dashboard to:**\n\n- Examine CPU utilization issues. It allows you to see overall CPU usage on the machine, but it won't identify the specific process responsible for high usage.\n- Monitor the system's average load time across three time intervals: 1 minute, 5 minutes, and 15 minutes. This information reflects the demand on the CPUs.\n- Confirm that the system clock is synchronized with an NTP server."
    },
    {
      "type": "image",
      "src": "/media/docs/learning-journey/linux/node-cpu.png",
      "alt": "Example Linux node CPU and system dashboard"
    },
    {
      "type": "markdown",
      "content": "## Linux node/filesystem and disks dashboard\n\nThis dashboard displays information about filesystems and disks, including available space per filesystem, overall disk space usage, read and write activity over time, and average wait times.\n\n**Use this dashboard to:**\n\n- Monitor disk capacity and determine when disks are nearing full utilization.\n- Find filesystems that have errors.\n- Detect when the input/output (I/O) load on the system is excessive, potentially leading to application latency."
    },
    {
      "type": "image",
      "src": "/media/docs/learning-journey/linux/node-disks.png",
      "alt": "Example Linux node filesystem disks dashboard"
    },
    {
      "type": "markdown",
      "content": "## Linux node/fleet overview dashboard\n\nThis dashboard provides an overview of the entire fleet, which includes the following information:\n\n- Metadata, such as the integration version and data retrieval status\n- List of fleet members\n- Performance metrics for the fleet, including CPU, memory, disk usage, and network activity\n\n**Use this dashboard to:**\n\n- Obtain a quick overview of the environment\n- Identify outliers or unusual activities, and investigate specific nodes for further details"
    },
    {
      "type": "image",
      "src": "/media/docs/learning-journey/linux/node-fleet-overview.png",
      "alt": "Example Linux fleet overview dashboard"
    },
    {
      "type": "markdown",
      "content": "## Linux node/logs dashboard\n\nThis dashboard provides an overview of logs gathered from the system, including the following:\n\n- Metadata, such as the integration version and data retrieval status\n- Performance metrics showing the volume of logs received\n- An interactive view of the log entries themselves\n\n**Use this dashboard to:**\n\n- Check that logs are being received in a timely fashion\n- Read and explore log entries"
    },
    {
      "type": "image",
      "src": "/media/docs/learning-journey/linux/node-logs.png",
      "alt": "Example Linux node logs dashboard"
    },
    {
      "type": "markdown",
      "content": "## Linux node/memory dashboard\n\nThis dashboard provides details about used and available memory, including:\n\n- Overview: Displays the percentage of total memory currently in use, both in real-time and over time.\n- Virtual memory statistics: Pages in/out, page faults, and Out of Memory (OOM) Killer information.\n- Memory statistics: Provides an overview of overall memory usage by processes, and how memory is allocated and freed.\n\n**Use this dashboard to:**\n\n- Track the memory usage of applications, including insights from the OOM Killer, which usually indicates a problem.\n- Analyze paging information, which can reveal if the system is overwhelmed by applications demanding more memory than is physically available."
    },
    {
      "type": "image",
      "src": "/media/docs/learning-journey/linux/node-memory.png",
      "alt": "Example Linux node memory dashboard"
    },
    {
      "type": "markdown",
      "content": "## Linux node/network dashboard\n\nThis dashboard offers insights into the network, including:\n\n- Network overview: Displays the status and usage of network devices connected to the system.\n- Network sockets: Provides a summary of opened, closed, and in-use network connections.\n- Network netstat: Presents an overview of packets being transmitted and received, including the error rate.\n\n**Use this dashboard to:**\n\n- Assess the functioning status of network devices.\n- Detect transmission errors. A high TCP error rate suggests that there may be a malfunction somewhere in the network."
    },
    {
      "type": "image",
      "src": "/media/docs/learning-journey/linux/node-network.png",
      "alt": "Example Linux node network dashboard"
    },
    {
      "type": "markdown",
      "content": "**More to explore (optional)**\n\n- [Build a dashboard](/docs/grafana-cloud/visualizations/dashboards/build-dashboards)"
    },
    {
      "type": "markdown",
      "content": "**Troubleshooting**\n\nExplore the following troubleshooting topic if you need help:\n\n- [I don't see logs in the log dashboard](/docs/grafana-cloud/monitor-infrastructure/integrations/troubleshoot/install-troubleshoot-linux-alloy/#alloy-was-not-able-to-collect-your-application-logs)"
    }
  ]
}
