{
  "id": "drilldown-logs-log-patterns",
  "title": "Filtering logs with log patterns",
  "blocks": [
    {
      "type": "markdown",
      "content": "Log patterns let you work with groups of similar log lines. You can hide log patterns that are noisy, or focus only on the patterns that are most useful."
    },
    {
      "type": "markdown",
      "content": "Grafana Logs Drilldown proactively visualizes your log volume data per detected pattern, broken down in various ways. At a glance you can immediately spot spikes or other changes."
    },
    {
      "type": "markdown",
      "content": "To filter the logs with log patterns, perform the following steps:"
    },
    {
      "type": "section",
      "blocks": [
        {
          "type": "markdown",
          "content": "To start your filters from scratch, remove all line filter selections above the **Logs** tab."
        },
        {
          "type": "interactive",
          "action": "highlight",
          "reftarget": "a[data-testid='data-testid tab-patterns']",
          "content": "Click the **Patterns** tab to show the log patterns that Logs Drilldown automatically detected.",
          "requirements": [
            "exists-reftarget"
          ]
        },
        {
          "type": "markdown",
          "content": "Identify a pattern that matches the type of logs you're interested in viewing."
        },
        {
          "type": "interactive",
          "action": "highlight",
          "reftarget": "button:contains('Include')",
          "content": "Click the **Include** button for the pattern.\n\nUsing the example from the previous milestone, the pattern `The flag is <_>` is selected.",
          "requirements": [
            "exists-reftarget"
          ],
          "doIt": false
        },
        {
          "type": "interactive",
          "action": "highlight",
          "reftarget": "a[data-testid='data-testid tab-logs']",
          "content": "Click the **Logs** tab again and investigate the log entries related to the log pattern you set.\n\nSince the example pattern included has a regex expression, the log entries both include `The flag is green` and `The flag is red`.",
          "requirements": [
            "exists-reftarget"
          ]
        }
      ]
    },
    {
      "type": "markdown",
      "content": "By using log patterns, you can filter logs beyond simple string matching or filtering. In this example, if more flag colors are logged in the future, the log pattern will automatically include the new color."
    },
    {
      "type": "markdown",
      "content": "In your next milestone, you'll open the logs in Explore view and see the query that generates the log visualization."
    }
  ]
}
