{
  "schemaVersion": "1.0.0",
  "id": "github-data-source-business-value",
  "title": "The case for observability",
  "blocks": [
    {
      "type": "markdown",
      "content": "IT systems are complicated. There are nodes, pods, services, system resources - sometimes thousands of them - all connected in a complex web of relationships. And when things go wrong, it can be very difficult to determine the root cause and fix it quickly. Consider the following:\n\n- Slow performance in an application might be caused by heavy load, or it could be a memory leak or even a hardware error. Monitoring your infrastructure allows you to find the root cause quickly and accurately.\n- Running out of disk space can be a disaster for any environment. Understanding that there's a problem before it becomes a problem enables you to prevent it.\n- When applications or services are co-located, being able to identify hotspots and conflicts between them can help you redistribute the load properly.\n\nAnd time is of the essence. System downtime can be very expensive. If you run customer-facing applications such as e-commerce site or a financial institution, every minute of downtime costs you money. Some estimates put the average cost of downtime at $5,600 per minute. If you are a large retailer, this cost can be much more. Even if you're not running a commercial service, downtime can have impact. If you can't turn on your lights because your home automation is having problems, it's still a real issue."
    },
    {
      "type": "markdown",
      "content": "## Enter...observability"
    },
    {
      "type": "video",
      "src": "https://www.youtube.com/embed/TQur9GJHIIQ",
      "provider": "youtube",
      "title": "What is observability?"
    },
    {
      "type": "markdown",
      "content": "Observability is the process of making a system's internal state more transparent. Systems are made observable by the data they produce, which in turn helps you to determine if your infrastructure or application is healthy and functioning normally."
    },
    {
      "type": "markdown",
      "content": "Observability is a holistic approach to understanding and managing complex systems. It involves collecting data from all parts of the system to create a deep understanding of the system's internal workings and how these interact with each other. Observability focuses on understanding and interpreting data to make the system's behavior and performance as transparent as possible. It also requires a means of making the data easily available for humans to interpret.\n\nAn observability system enables system operators, DevOps practitioners, and site reliability engineers to ask questions across the information gathered. These are questions that are not anticipated in advance, but rather questions that arise due to unexpected or novel events within a system."
    },
    {
      "type": "markdown",
      "content": "**More to explore (optional)**\n\nAt this point in your journey, you can explore the following paths:\n\n- [What is observability?](/docs/grafana-cloud/introduction/what-is-observability/)"
    }
  ]
}
