{
  "id": "fleet-management-revert-pipeline-version",
  "title": "Revert a configuration pipeline version",
  "blocks": [
    {
      "type": "markdown",
      "content": "This guide teaches you how to revert to a previous version of a configuration pipeline.\n\nGrafana Fleet Management tracks changes to configuration pipelines and displays them in the **Pipelines history** feature on the **Remote configuration** tab. With pipeline history, your team can collaborate more efficiently, ensure audit compliance, and troubleshoot issues caused by configuration changes.\n\nThe Pipelines history log tracks creation and deletion of pipelines, changes to configuration content, and modifications to matching attributes. You can review changes for a specific pipeline by searching the log for a pipeline name, ID, or matching attribute. To view changes to configuration content, click the **History details** button in an event row and examine the pipeline on its own or compare it with another version of the same pipeline."
    },
    {
      "type": "interactive",
      "action": "highlight",
      "reftarget": "div[data-testid='remote-configuration-page'] svg[data-testid='icon-history']:nth-match(1)",
      "content": "Click the Pipeline history icon for the configuration pipeline you want to revert.",
      "requirements": [
        "exists-reftarget",
        "on-page:/grafana-collector-app/fleet-management/remote-configuration"
      ],
      "doIt": false
    },
    {
      "type": "interactive",
      "action": "button",
      "reftarget": "button:contains('History details')",
      "content": "Click the History details button for the change you want to review.",
      "doIt": false
    },
    {
      "type": "interactive",
      "action": "button",
      "reftarget": "button:contains('Restore')",
      "content": "Click the **Restore** button to reset the configuration pipeline to the version shown. On the **Restore pipeline** screen, review the configuration and select the set of matching attributes to apply. Click **Restore** again."
    }
  ]
}
