{
  "id": "prometheus-lj",
  "title": "Connect to a Prometheus data source in Grafana Cloud",
  "blocks": [
    {
      "type": "markdown",
      "content": "Welcome to the Grafana learning journey that provides best practices for monitoring a Prometheus data source.\n\nPrometheus is an open source systems monitoring and alerting toolkit that captures metrics as time series data and optional key-value pairs called labels. Prometheus scrapes metrics from instrumented jobs, either directly or by way of an intermediary push gateway for short-lived jobs. It stores all scraped samples locally and runs rules over this data to either aggregate and record new time series from existing data, or generate alerts.\n\nThis journey teaches you how to configure a plugin that enables you to query, drill down, and visualize Prometheus metrics.\n\nThe following image shows the Grafana Drilldown Metrics app populated with Prometheus metrics.\n\n![Image that shows Prometheus metrics in Grafana Drilldown Metrics](/media/docs/learning-journey/prom-data-source/explore-metrics.png)"
    },
    {
      "type": "markdown",
      "content": "## Here's what to expect\n\nWhen you complete this journey, you will be able to:\n\n1. Describe the value of monitoring a Prometheus endpoint\n2. Verify that your self-managed Prometheus server is capturing metrics\n3. Enter the URL and credentials of your Prometheus server\n4. Select a private data source connection and test the connection\n5. Verify that metrics appear in Grafana Drilldown Metrics"
    },
    {
      "type": "markdown",
      "content": "## Troubleshooting\n\nIf you get stuck, we've got your back! Where appropriate, troubleshooting information is just a click away.\n\n## More to explore\n\nWe understand you might want to explore other capabilities not strictly on this path. We'll provide you opportunities where it makes sense.\n\n## Before you begin\n\nBefore you connect to a Prometheus data source, ensure you have:\n\n- A Grafana Cloud account. To create an account, see [Grafana Cloud](https://grafana.com/signup/cloud/connect-account).\n- Experience working with Prometheus and understand its basic set up and operation.\n- Downloaded, installed, and configured Prometheus to collect metrics.\n- Access to the machine on which Prometheus is installed.\n- Knowledge of the authentication method applied to the Prometheus database and credentials of the Prometheus database.\n- [Created a private connection to a data source](/docs/learning-paths/private-data-source-connect) and the PDC agent is running.\n  - While not required, setting up a private data source connection is highly recommended."
    }
  ]
}
