{
  "schemaVersion": "1.0.0",
  "id": "mongodb-integration-understand-dashboards",
  "title": "Understand MongoDB dashboards",
  "blocks": [
    {
      "type": "markdown",
      "content": "The MongoDB integration provides three pre-built dashboards that you can use immediately to begin monitoring and troubleshooting database performance issues. In this step of the journey, you'll become familiar with these pre-built dashboards and learn how to use them to address various problems.\n\nWhile this journey focuses on configuring the MongoDB integration for one instance, the following dashboard images show the kinds of data you'll see when you monitor multiple MongoDB instances across your infrastructure.\n\n**Did you know?** If you don't see any metrics, try switching the data source using the drop-down at the top of the dashboard."
    },
    {
      "type": "markdown",
      "content": "## MongoDB Cluster dashboard\n\nThis dashboard provides a comprehensive view of your MongoDB cluster performance and health, including:\n\n- **Cluster-wide metrics**: Overall cluster performance indicators and health status\n- **Cross-node comparison**: Performance metrics across different MongoDB nodes\n- **Resource utilization**: Cluster-level resource consumption and capacity planning\n- **Sharding statistics**: Information about data distribution and shard performance\n\n**Use this dashboard to:**\n\n- Monitor overall cluster health and performance trends\n- Compare performance across different nodes in your cluster\n- Identify capacity planning needs and resource bottlenecks\n- Track sharding efficiency and data distribution"
    },
    {
      "type": "markdown",
      "content": "## MongoDB Instance dashboard\n\nThis dashboard offers detailed insights into individual MongoDB instance performance, including:\n\n- **Instance status**: Displays whether MongoDB is running and reachable\n- **Connection statistics**: Shows current active connections and available connection capacity\n- **Operation rates**: Displays operations per second by type (insert, query, update, delete)\n- **Memory utilization**: Shows current memory usage patterns and trends\n- **Storage metrics**: Indicates database and index size information\n\n**Use this dashboard to:**\n\n- Monitor individual instance health and performance\n- Track connection usage and identify potential connection issues\n- Analyze operation patterns and query performance\n- Monitor memory and storage utilization for capacity planning"
    },
    {
      "type": "markdown",
      "content": "## MongoDB ReplicaSet dashboard\n\nThis dashboard provides comprehensive monitoring of MongoDB replica set health and replication performance, including:\n\n- **Replica member status**: Health status of all replica set members\n- **Replication lag**: Delay between primary and secondary members\n- **Election metrics**: Information about replica set elections and state changes\n- **Oplog statistics**: Oplog size and utilization for replication tracking\n\n**Use this dashboard to:**\n\n- Monitor replica set health and member availability\n- Track replication performance and identify lag issues\n- Plan for failover scenarios and election patterns\n- Ensure data consistency across replica set members\n\nIn your final milestone, you'll complete the MongoDB monitoring journey."
    },
    {
      "type": "markdown",
      "content": "## More to explore (optional)\n\nAt this point in your journey, you can explore the following paths:\n\n- [MongoDB performance optimization techniques](/docs/grafana-cloud/knowledge-graph/enable-prom-metrics-collection/data-stores/mongodb/)"
    }
  ]
}
