{
  "id": "visualization-logs-time-range-refresh",
  "title": "Configure visualization time range and refresh interval",
  "blocks": [
    {
      "type": "markdown",
      "content": "You can define the time span for which data is displayed in the visualization. For instance, if the current time is 1 PM and you set a time range of 1 hour, the visualization will show data from 12 PM to 1 PM. A variety of predefined time ranges are available for selection.\n\nAdditionally, you can enable automatic data refresh for the visualization. The refresh interval determines how frequently the data is updated. For example, setting a 1-minute refresh interval means that the data updates every minute. You can choose from multiple refresh intervals based on your specific needs."
    },
    {
      "type": "markdown",
      "content": "**Tip:** Choose the slowest refresh interval that meets your requirements. If near real-time updates are unnecessary, opt for a 1-minute or longer refresh interval. Selecting a faster interval when data changes infrequently can degrade dashboard performance.\n\nTo configure the time range and refresh interval, complete the following steps:"
    },
    {
      "type": "section",
      "blocks": [
        {
          "type": "interactive",
          "action": "highlight",
          "reftarget": "[data-testid='data-testid TimePicker Open Button']",
          "content": "To select a time range, click the **time picker** drop-down and select a time range (for example, `Last 6 hours`).",
          "doIt": false,
          "requirements": ["exists-reftarget"]
        },
        {
          "type": "interactive",
          "action": "highlight",
          "reftarget": "[data-testid='data-testid RefreshPicker interval button']",
          "content": "To select a refresh interval, click the **refresh** drop-down and select a time interval (for example, `5s`).",
          "doIt": false,
          "requirements": ["exists-reftarget"]
        },
        {
          "type": "markdown",
          "content": "You are now ready to save the dashboard so that other users can view it."
        }
      ]
    },
    {
      "type": "markdown",
      "content": "## More to explore (optional)\n\nAt this point in your journey, you can explore the following paths:\n\n- [Common time range controls](/docs/grafana-cloud/visualizations/dashboards/use-dashboards/#common-time-range-controls)\n- [Refresh dashboard](/docs/grafana-cloud/visualizations/dashboards/use-dashboards/#refresh-dashboard)\n- [Troubleshoot dashboards](/docs/grafana-cloud/visualizations/dashboards/troubleshoot-dashboards)"
    }
  ]
}
