{
  "schemaVersion": "1.0.0",
  "id": "send-logs-alloy-loki-business-value-alloy",
  "title": "The value of Grafana Alloy",
  "blocks": [
    {
      "type": "markdown",
      "content": "Grafana Alloy combines the strengths of the leading telemetry collectors into one place. Whether observing applications, infrastructure, or both, Grafana Alloy can collect, process, and export telemetry signals to scale and future-proof your observability approach.\n\nThe following diagram illustrates the architecture and data flow of Grafana Alloy in a telemetry pipeline. It shows how Alloy acts as a single point for collecting and forwarding telemetry data.\n\n![Image that shows how Alloy collects telemetry signals and pushes them to various databases and collectors](/media/docs/alloy/alloy_diagram_v2.svg)\n\nThere are multiple ways to send logs to Grafana Cloud, but using Alloy offers several key benefits:\n\n- Alloy supports collecting metrics, logs, traces, and profiles in a single agent. Instead of running separate agents, you can use one tool to simplify your configuration, deployment, and maintenance.\n- Alloy has native pipelines for leading telemetry signals, such as [Prometheus](https://prometheus.io/) and [OpenTelemetry](https://opentelemetry.io/), and databases such as Loki and [Pyroscope](/docs/pyroscope/latest/).\n- Alloy improves reliability and provides advanced features for Enterprise needs, such as clusters of fleets and balancing workloads. Alloy is inspired by OpenTelemetry pipelines, which you may already be familiar with.\n- Because Alloy runs on a single agent to collect multiple telemetry types, it reduces memory usage, CPU overhead, and other operational complexities.\n- Alloy uses modular components to perform a single task, such as retrieving or redacting secrets, collecting Prometheus metrics, or sending logs to Loki. Components are chained together, creating a customizable pipeline that suits your project needs.\n\nIn the next milestone, you're going to install Alloy into your local machine.\n\n**More to explore (optional)**\n\n- [Introduction to Grafana Alloy](/docs/alloy/latest/introduction/#introduction-to-grafana-alloy)\n- [Introducing Grafana Alloy, A Distribution of the OTel Collector | GrafanaCON 2024 | Grafana](https://www.youtube.com/watch?v=d9zLeFuIFIk)\n- [Grafana Alloy for Beginners series](https://www.youtube.com/playlist?list=PLDGkOdUX1UjoUmd6Z-lKgGaGzmZvYxRWs)"
    }
  ]
}
