{
  "id": "connect-metrics-data",
  "title": "Connect a metrics data source to Grafana Cloud",
  "blocks": [
    {
      "type": "markdown",
      "content": "Use this interactive guide to learn how to start connecting **Prometheus metrics** to Grafana Cloud. You’ll explore where metrics connections live, select Prometheus from the connection catalog, and review the information required to complete setup.\n\n\n\nThis guide helps you get oriented and understand the setup process, without requiring existing infrastructure or completing the connection."
    },
    {
      "type": "interactive",
      "action": "highlight",
      "reftarget": "a[data-testid='data-testid Nav menu item'][href='/connections']",
      "content": "Metrics, logs, and traces all start with a connection.\n\nBegin by opening Connections to see where you can add and manage data sources in Grafana Cloud.",
      "requirements": [
        "navmenu-open"
      ],
      "doIt": true
    },
    {
      "type": "interactive",
      "action": "button",
      "reftarget": "div:nth-of-type(1)",
      "content": "To connect metrics data, start by adding a new connection.\n\nThis opens the catalog where you can browse and choose the type of data source you want to connect.",
      "requirements": [
        "on-page:/connections"
      ],
      "doIt": true
    },
    {
      "type": "multistep",
      "content": "Prometheus is a common choice for collecting metrics in Grafana Cloud.\n\nSelect Prometheus to view the available connection options. \n\nGrafana Cloud supports two approaches: Hosted Prometheus Metrics, a fully managed service where you send metrics to Grafana Cloud, and Prometheus Data Source, which lets you query an existing Prometheus instance directly.\n\nSelect Hosted Prometheus Metrics.",
      "steps": [
        {
          "action": "highlight",
          "reftarget": "[role='button']:contains('Prometheus')"
        },
        {
          "action": "highlight",
          "reftarget": "a[data-testid='prometheus-hosted-option']"
        }
      ],
      "requirements": [
        "on-page:/connections"
      ]
    },
    {
      "type": "markdown",
      "content": "This page shows the steps required to send Prometheus metrics to Grafana Cloud.\n\nYou’ll choose a method for forwarding metrics (for example, using Grafana Alloy), then install and configure the required components in your environment. These steps typically involve running commands outside of Grafana Cloud.\n\nYou don’t need to complete this setup now. You can return to this page anytime when you’re ready to connect your Prometheus metrics.\n\n"
    }
  ],
  "match": {
    "urlPrefix": [],
    "tags": []
  }
}
