{
  "id": "windows-integration-configure-alloy",
  "title": "Configure Grafana Alloy to use the Windows integration",
  "blocks": [
    {
      "type": "markdown",
      "content": "After you've installed Grafana Alloy, the next step is to configure it for the Windows integration. This configuration process requires you to copy a code snippet from Grafana Cloud and add it to the Alloy configuration file."
    },
    {
      "type": "markdown",
      "content": "💡 **Did you know?** By default, the integration only collects the metrics and logs necessary to populate the Windows dashboards and alerts. Although you have the option to configure Alloy to collect all available metrics and logs, we recommend starting with the default configuration."
    },
    {
      "type": "markdown",
      "content": "To configure Alloy to use the Windows integration, complete the following steps:"
    },
    {
      "type": "section",
      "blocks": [
        {
          "type": "markdown",
          "content": "In Grafana Cloud, under the **Set up Grafana Alloy to use the Windows integration** section, click **Copy to clipboard**."
        },
        {
          "type": "markdown",
          "content": "On your Windows system, open Command Prompt as Administrator."
        },
        {
          "type": "markdown",
          "content": "Open the Alloy configuration file with Notepad:\n\n```cmd\nnotepad \"C:\\Program Files\\GrafanaLabs\\Alloy\\config.alloy\"\n```"
        },
        {
          "type": "markdown",
          "content": "Scroll to the end of the configuration file and paste the code snippet you copied from Grafana Cloud."
        },
        {
          "type": "markdown",
          "content": "Click **File > Save** to save the changes."
        },
        {
          "type": "markdown",
          "content": "Close Notepad."
        }
      ]
    },
    {
      "type": "markdown",
      "content": "In the next step of your journey, you'll restart Alloy and test the configuration."
    },
    {
      "type": "markdown",
      "content": "**More to explore (optional)**\n\n- [Configure Grafana Alloy](/docs/alloy/latest/configure)\n- [Windows exporter collector](/docs/alloy/latest/reference/components/prometheus/prometheus.exporter.windows)"
    }
  ]
}
