{
  "id": "kafka-monitoring-explore-kafka-metrics",
  "title": "Explore Kafka metrics",
  "blocks": [
    {
      "type": "markdown",
      "content": "Understanding how to interpret the key Kafka performance metrics displayed in your dashboards is essential for maintaining a healthy cluster. Important metrics include message throughput, byte rates, consumer lag, under-replicated partitions, and request latencies. Each of these metrics provides insights into different aspects of your Kafka cluster's health and performance.\n\nNormal operating ranges vary by workload, but certain metrics have clear indicators of problems. For example, under-replicated partitions should typically be 0 in a healthy cluster, the active controller count should always be 1, and consumer lag should remain low relative to your message ingestion rate. High request latencies or growing consumer lag often indicate resource constraints or configuration issues that require investigation.\n\nTo explore Kafka metrics in your dashboards, complete the following steps:"
    },
    {
      "type": "section",
      "id": "explore-metrics-steps",
      "blocks": [
        {
          "type": "interactive",
          "action": "highlight",
          "content": "Open the Kafka Overview dashboard from the **Dashboards** menu.",
          "reftarget": "a[data-testid='data-testid Nav menu item'][href='/dashboards']",
          "requirements": [
            "navmenu-open",
            "exists-reftarget"
          ],
          "doIt": false
        },
        {
          "type": "markdown",
          "content": "Review the **Messages In Rate** panel to see the volume of messages being produced to your topics.\n\nCheck the **Bytes In/Out Rate** panels to monitor data throughput across your cluster.\n\nExamine the **Under Replicated Partitions** panel - this should typically be 0 in a healthy cluster.\n\nReview the **Request Latency** panels to identify slow produce or fetch requests.\n\nCheck the **Active Controller Count** panel - this should always be 1 in a healthy cluster."
        },
        {
          "type": "markdown",
          "content": "Navigate to the Kafka Broker Metrics dashboard to view individual broker performance.\n\nReview broker-specific metrics including CPU usage, network throughput, and request queue size.\n\nExplore the Kafka Topic Metrics dashboard to analyze per-topic message rates and retention."
        },
        {
          "type": "interactive",
          "action": "highlight",
          "content": "Use the time range selector to analyze historical trends and identify patterns.",
          "reftarget": "button[data-testid='data-testid TimePicker Open Button']",
          "requirements": [
            "exists-reftarget"
          ],
          "doIt": false
        }
      ]
    },
    {
      "type": "markdown",
      "content": "You can interpret the Kafka metrics displayed across your dashboards and identify which panels indicate healthy operation versus potential issues. The dashboards show data for all configured brokers and topics in your cluster.\n\nIn the next milestone, you celebrate completing this learning journey!"
    }
  ]
}
