{
  "id": "adaptive-metrics-recommendations",
  "title": "Reduce metric volume using Adaptive Metrics",
  "blocks": [
    {
      "type": "markdown",
      "content": "Use this interactive guide to learn how **Adaptive Metrics** helps you reduce metric volume safely by recommending aggregations and reductions for underused series. You’ll explore where Adaptive Metrics lives in Grafana Cloud, review how recommendations are generated from dashboard, alert, and query usage, and understand your options for reviewing, filtering, editing, or applying aggregation recommendations."
    },
    {
      "type": "section",
      "blocks": [
        {
          "type": "interactive",
          "action": "highlight",
          "reftarget": "a[data-testid='data-testid Nav menu item'][href='/adaptive-telemetry']",
          "content": "Adaptive Metrics is part of Adaptive Telemetry. Start by opening **Adaptive Telemetry** to see where Grafana Cloud helps you optimize metrics, logs, and traces based on real usage.",
          "requirements": [
            "exists-reftarget",
            "navmenu-open"
          ]
        },
        {
          "type": "interactive",
          "action": "highlight",
          "reftarget": "a[href*='adaptive-metrics']",
          "content": "Select **Adaptive Metrics** to open metric optimization recommendations. Adaptive Metrics analyzes your dashboards, alerts, recording rules, and query usage to suggest safe aggregations that reduce cardinality and cost while preserving signal."
        },
        {
          "type": "interactive",
          "action": "highlight",
          "reftarget": "a[data-testid='data-testid Tab Rules']",
          "content": "Open the **Rules** tab to review recommendations for aggregations and series reductions. This is where you’ll spend most of your time reviewing, filtering, and deciding which changes to apply.",
          "requirements": [
            "exists-reftarget"
          ]
        }
      ],
      "id": "open-adaptive-metrics",
      "title": "Get oriented with Adaptive Metrics"
    },
    {
      "type": "section",
      "blocks": [
        {
          "type": "interactive",
          "action": "highlight",
          "reftarget": "select, div:has(label:contains('Segment'))",
          "content": "Use the **Segment** selector to choose the scope for recommendations. Segments let you apply different optimization strategies per team, environment, or workload.",
          "doIt": false
        },
        {
          "type": "markdown",
          "content": "Segments scope recommendations. Start with the Default segment to understand out-of-the-box suggestions, or pick a team- or environment-specific segment to apply tailored rules without affecting other groups."
        }
      ],
      "id": "select-segment",
      "title": "Pick a segment"
    },
    {
      "type": "section",
      "blocks": [
        {
          "type": "interactive",
          "action": "highlight",
          "reftarget": "div[data-testid='filter-field'] div:nth-match(5)",
          "content": "Use the **Metric name** filter to narrow the list to metrics you care about. This helps you prioritize review by service, team, or a specific high-cardinality series.",
          "requirements": [
            "exists-reftarget"
          ],
          "doIt": false
        },
        {
          "type": "interactive",
          "action": "highlight",
          "reftarget": "div[data-testid='recommendation-type']",
          "content": "Choose a **Recommendation type** (All, Add, Keep, Remove, Update) to focus on the kinds of changes you want to consider. For example, choose 'Remove' to surface series that can be safely reduced or aggregated.",
          "requirements": [
            "exists-reftarget"
          ],
          "doIt": false
        },
        {
          "type": "markdown",
          "content": "Filtering by metric name and recommendation type helps you create a manageable review list. Combine these filters to find metrics used by alerts, dashboards, or queries that may need a conservative approach."
        }
      ],
      "id": "filter-metrics",
      "title": "Filter metric name and recommendation type"
    },
    {
      "type": "section",
      "blocks": [
        {
          "type": "interactive",
          "action": "noop",
          "content": "The recommendations table lists metric families, received series, current rule impact, and the recommendation impact (projected series reduction). \n\nUse the checkboxes to select multiple recommendations for bulk actions."
        },
        {
          "type": "markdown",
          "content": "Each row usually shows: \n\n- **Metric** name or family\n- **Received series** (how many distinct series were observed)\n- **Current rule impact** (what rules currently apply)\n- **Recommendation impact** (projected series saved). Use these values to prioritize high-volume, low-value series first.\n\n"
        },
        {
          "type": "interactive",
          "action": "noop",
          "content": "Click **Apply all recommendations** to implement suggested aggregations and reductions across selected segments."
        },
        {
          "type": "markdown",
          "content": "Applying recommendations is a forward-facing change: it changes how future series are recorded or aggregated. If you're unsure, edit or protect critical metrics before applying bulk changes."
        }
      ],
      "id": "review-recommendations",
      "title": "Review and apply recommendations"
    },
    {
      "type": "section",
      "blocks": [
        {
          "type": "interactive",
          "action": "noop",
          "content": "Click the chevron to expand a recommendation and view detailed rule information including expected series reduction, suggested aggregation, and labels proposed for dropping."
        },
        {
          "type": "markdown",
          "content": "In the expanded view you’ll typically see: \n\n- **Rule information** describing the suggested aggregation or recording rule,\n- **Metric usage stats** showing dashboards, queries, and alerting or recording rule usage\n- **Projected series change** (for example, a reduction from 51.8k series to 992 series)\n- Proposed **aggregations** and **drop labels**. Use these details to judge risk. If the metric is used by alerts or dashboards, consider editing the recommendation or protecting the metric.\n\n"
        },
        {
          "type": "interactive",
          "action": "noop",
          "content": "Open the Edit view to adjust the aggregation, change which labels are dropped, review projected savings, or protect the metric to prevent bulk updates from affecting it."
        }
      ],
      "id": "expand-recommendation-details",
      "title": "What you see when you expand a recommendation"
    },
    {
      "type": "markdown",
      "content": "Congratulations! You now know where to find Adaptive Metrics recommendations and how to pick a segment, filter metrics, choose recommendation types, review details, and apply changes to reduce metric volume safely. You’re ready to continue optimizing metrics with more control and confidence."
    }
  ]
}
