{
  "id": "visualization-metrics-plan",
  "title": "Plan your visualization",
  "blocks": [
    {
      "type": "markdown",
      "content": "Visualizations and dashboards are powerful tools designed to provide actionable insights into business problems. By translating raw data into meaningful visual representations, they help you identify trends, monitor performance, and make informed decisions. To maximize their value, it's essential to align your visualizations with your business goals."
    },
    {
      "type": "markdown",
      "content": "## Key questions to consider\n\nWhen creating dashboards and visualizations, the sheer number of metrics, visualization types, and data transformation options can feel overwhelming. The key to success lies in aligning your dashboards with your business objectives. While anyone can create a dashboard that visualizes data, the real challenge is ensuring that the data and visualization types are both relevant and effective in solving specific business problems.\n\nAs you start planning your dashboards and visualizations, consider the following questions to guide your approach:\n\n- **What business problem are you trying to solve?**  \n  Clearly define the problem you want to address. This ensures that your visualizations are purpose-driven and focused on actionable insights.\n  \n    - *Example:* If your goal is to reduce server downtime, your visualization should focus on metrics like system uptime, error rates, and server health.\n\n- **What specific questions should a visualization answer?**  \n  Break down the business problem into smaller, measurable questions that your visualization can address. This helps you identify the exact data you need to display.\n\n     - *Example:* For improving application performance, you might ask, \"What are the peak traffic times?\" or \"Which endpoints are experiencing the highest latency?\"\n\n- **Which metrics will provide relevant insights?**  \n  From a vast array of available metrics, select the ones that directly provide the insights you need. This requires a solid understanding of your data, the meaning behind each metric, and its relevance to your objectives.\n\n    - *Examples:* `node_cpu_seconds_total` for CPU usage, `machine_memory_bytes` for memory capacity, or `node_filesystem_device_error` for filesystem issues.\n\n- **How will the insights help drive decisions or actions?**  \n  Ensure that the visualizations provide actionable insights that can inform decisions or trigger specific actions. This step bridges the gap between data and outcomes.  \n  \n     - *Example:* If your visualization shows a spike in error rates during specific hours, you can schedule additional monitoring or allocate resources to address the issue proactively.\n\nBy answering these questions, you can create dashboards that not only display data but also empower your team to make informed, high impact decisions."
    }
  ]
}
