{
  "id": "visualization-metrics-business-value",
  "title": "About dashboards and visualizations",
  "blocks": [
    {
      "type": "markdown",
      "content": "Observability is a cornerstone of site reliability engineering (SRE). It enables engineers to gain deep insights into the health, performance, and behavior of complex systems. By collecting and analyzing telemetry data such as logs, metrics, and traces, observability helps identify and resolve issues before they impact users.\n\nDashboards and visualizations are critical tools in this process. They provide a clear, real-time view of system performance, making it easier to detect anomalies, track trends, and correlate events. For example:\n\n- State timeline visualizations help engineers monitor and analyze changes in states or statuses of various entities over time."
    },
    {
      "type": "image",
      "src": "/media/docs/grafana/panels-visualizations/screenshot-state-timeline-v11.4.png",
      "alt": "A state timeline visualization showing CPU usage"
    },
    {
      "type": "markdown",
      "content": "- Time-series visualizations can reveal latency spikes, enabling engineers to address performance degradation proactively."
    },
    {
      "type": "image",
      "src": "/media/docs/learning-journey/metrics-viz/time-series-viz.png",
      "alt": "A time-series visualization showing CPU usage"
    },
    {
      "type": "markdown",
      "content": "- Alert list visualizations can quickly display a list of important alerts, such as high CPU usage or failed status checks."
    },
    {
      "type": "image",
      "src": "/media/docs/learning-journey/metrics-viz/alert-viz.png",
      "alt": "An alert visualization showing alerts firing"
    },
    {
      "type": "markdown",
      "content": "Dashboards and visualizations transform raw data into actionable insights, empowering SREs to maintain high availability, optimize resource allocation, and deliver a seamless user experience—all while saving the business money by minimizing disruptions and operational inefficiencies. By leveraging these visualizations, businesses can prevent costly downtime and maintain customer trust."
    }
  ]
}
