{
  "id": "understanding-the-four-golden-signals-of-observability",
  "title": "Understanding the Four Golden Signals of Observability",
  "blocks": [
    {
      "type": "markdown",
      "content": "This guide will explain the **Four Golden Signals** of Observability **- Latency, Traffic, Errors and Saturation -** with conceptual explanations and examples of how they can be visualized in a dashboard.\n\n# Introduction\n\nIn modern software systems observability is essential to maintaining reliability and performance. One of the most influential frameworks for measuring system health and user experience is the **Four Golden Signals**, popularized by Google’s Site Reliability Engineering (SRE) practices and first published in the [Google SRE Book in 2017](https://sre.google/sre-book/).\n\nBefore that, system monitoring was often ad hoc, focusing on host-level metrics (CPU, memory, disk). As systems grew into **complex, distributed architectures**, Google engineers realized traditional monitoring wasn’t enough — they needed a **universal, user-centric framework**.\n\nThe Four Golden Signals evolved as a set of metrics to describe the health of *any* service from an end-user perspective.\n\nOver time, this model became foundational to modern Observability practices.\n\n# The Four Golden Signals\n\nThe Signals are explained in the [SRE Book](https://sre.google/sre-book/monitoring-distributed-systems/#xref_monitoring_golden-signals) as following:\n\n## Latency\n\n### Definition\n\nThe time it takes to service a request. It’s important to distinguish between the latency of successful requests and the latency of failed requests. For example, an HTTP 500 error triggered due to loss of connection to a database or other critical backend might be served very quickly; however, as an HTTP 500 error indicates a failed request, factoring 500s into your overall latency might result in misleading calculations. On the other hand, a slow error is even worse than a fast error! Therefore, it’s important to track error latency, as opposed to just filtering out errors.\n\n### Why it matters\n\nHigh latency directly affects user experience. Monitoring latency helps identify performance bottlenecks or overloaded components."
    }
  ]
}
