{
  "schemaVersion": "1.0.0",
  "id": "create-availability-slo-monitor-slo",
  "title": "Monitor your SLO",
  "blocks": [
    {
      "type": "markdown",
      "content": "After creating an SLO, you can monitor its performance using the SLO detail view. The dashboard shows your current SLI value, error budget remaining, and burndown trends. Understanding the error budget burndown chart helps you identify when reliability is degrading before you exhaust your budget."
    },
    {
      "type": "multistep",
      "content": "Navigate to **Alerts & IRM > SLO**.",
      "requirements": ["navmenu-open"],
      "steps": [
        {
          "action": "highlight",
          "reftarget": "button[aria-label^=\"Collapse section: Alerts\"]"
        },
        {
          "action": "highlight",
          "reftarget": "a[href=\"/a/grafana-slo-app/home/insights\"]"
        }
      ]
    },
    {
      "type": "markdown",
      "content": "Click on your SLO name to open the detail view."
    },
    {
      "type": "markdown",
      "content": "Review the **Error Budget Burndown** chart to see how your error budget is being consumed over time."
    },
    {
      "type": "markdown",
      "content": "Check the **SLI** panel to see your current reliability percentage."
    },
    {
      "type": "markdown",
      "content": "Review the **Error budget remaining** indicator to understand how much error budget you have left."
    },
    {
      "type": "markdown",
      "content": "Use the time range selector to zoom in on specific periods of interest."
    },
    {
      "type": "markdown",
      "content": "## How to read the burndown chart\n\nThe **Error Budget Burndown** chart shows remaining error budget over time.\n\n- A _downward slope_ means the budget is being consumed (incidents or unreliability).\n- A _steeper slope_ means consumption is faster.\n- In ideal conditions the line stays near the top. If it approaches zero, you're at risk of exhausting the budget before the window resets.\n\nUse this to spot degrading reliability early and decide when to prioritize fixes over new features.\n\n**What to do when budget is low:**\n- Consider pausing feature work and focusing on reliability: fix incidents, reduce error rates, or improve the SLI.\n- Add [SLO alert rules](/docs/grafana-cloud/alerting-and-irm/slo/create/#add-slo-alert-rules) to get notified when budget consumption crosses a threshold.\n\nYou can view your SLO's current status, error budget consumption, and historical performance.\n\nIn your final milestone, you'll review what you've accomplished in this journey."
    },
    {
      "type": "markdown",
      "content": "## More to explore (optional)\n\nAt this point in your journey, you can explore the following paths:\n\n- [SLO dashboards](/docs/grafana-cloud/alerting-and-irm/slo/)"
    }
  ]
}
