{
  "schemaVersion": "1.0.0",
  "id": "create-availability-slo-value-of-slos",
  "title": "The value of SLOs for reliability",
  "blocks": [
    {
      "type": "markdown",
      "content": "Service Level Objectives (SLOs) provide a measurable way to define and track the reliability of your services. Instead of reacting to outages, SLOs help teams proactively manage reliability by setting clear targets and tracking error budgets. When you know how much unreliability you can tolerate, you can make better decisions about when to ship features versus when to focus on stability.\n\nSLOs bridge the gap between technical metrics and business outcomes. SLOs can translate raw metrics like request success rates into meaningful targets that both engineers and stakeholders can understand. This shared language helps teams align on reliability goals and make data-driven decisions.\n\nYou might set an availability target for a service that handles requests, jobs, or user traffic: what percentage of those operations should succeed? That target, and the \"error budget\" (the small amount of failure you allow), gives the team a shared definition of \"reliable enough\" and helps you decide when to ship new work versus when to focus on stability.\n\nWith Grafana SLO, you can:\n\n- Define clear reliability targets that align technical metrics with business expectations.\n- Track error budgets to understand how much unreliability you can tolerate.\n- Make informed decisions about when to invest in reliability versus new features.\n- Visualize SLO performance with built-in dashboards and error budget burndown charts.\n- Set up alerts when error budgets are at risk of being exhausted.\n\nIn the next milestone, you'll define a reliability SLI by identifying the metrics that measure your service's success."
    },
    {
      "type": "markdown",
      "content": "## More to explore (optional)\n\nAt this point in your journey, you can explore the following paths:\n\n- [SLO documentation](/docs/grafana-cloud/alerting-and-irm/slo/)"
    }
  ]
}
