{
  "id": "windows-integration-understand-alerts",
  "title": "About Windows integration pre-built alerts",
  "blocks": [
    {
      "type": "markdown",
      "content": "The Windows integration provides a variety of pre-built alerts that you can use right away to begin identifying and troubleshooting issues. In this step of the journey, you'll become familiar with these pre-built alerts and learn how to use them to address various problems."
    },
    {
      "type": "markdown",
      "content": "💡 **Did you know?** If your machine is functioning properly, you won't receive any alerts. No news is good news!"
    },
    {
      "type": "markdown",
      "content": "## Windows exporter alerts"
    },
    {
      "type": "markdown",
      "content": "### WindowsCPUHighUsage\n\n**Description:** High CPU usage\n\n**What this means:** This alert could mean that a process has failed or that the system is overloaded. CPU usage exceeding 80% for a sustained period can indicate resource contention.\n\n**What to do:** Identify processes consuming excessive CPU resources and check that all processes are operating as expected. Consider distributing workloads if the system consistently operates near capacity limits."
    },
    {
      "type": "markdown",
      "content": "### WindowsMemoryHighUtilization\n\n**Description:** High memory utilization\n\n**What this means:** Memory utilization exceeding 90% indicates the system is running out of available memory. This could be caused by a memory leak in a program or insufficient RAM for current workloads.\n\n**What to do:** Check that all processes are operating as expected. If applicable, fix any memory leaks and restart the affected process, or add additional RAM to the system."
    },
    {
      "type": "markdown",
      "content": "### WindowsDiskAlmostOutOfSpace\n\n**Description:** Disk has less than 10% space left\n\n**What this means:** The disk is almost full, indicating limited storage space. This can lead to application failures and system instability.\n\n**What to do:** Add storage capacity or remove unnecessary files to free up space. Schedule cleanup or expansion before critical thresholds are reached."
    },
    {
      "type": "markdown",
      "content": "### WindowsDiskDriveNotHealthy\n\n**Description:** Physical disk reports unhealthy status\n\n**What this means:** The storage subsystem has detected a failing or degraded disk. This is a critical alert indicating potential hardware failure and risk of data loss.\n\n**What to do:** Proactively identify and replace the failing hardware before data loss occurs. Monitor storage subsystem health and plan for disk replacement."
    },
    {
      "type": "markdown",
      "content": "### WindowsNTPClientDelay\n\n**Description:** NTP client delay exceeds threshold\n\n**What this means:** Network latency issues affect time synchronization. The delay between the Windows system and the NTP server is too high to maintain accurate time.\n\n**What to do:** Identify network latency issues that affect time synchronization. Ensure accurate timestamping for logs and metrics by checking network connectivity and NTP server availability."
    },
    {
      "type": "markdown",
      "content": "### WindowsNTPTimeOffset\n\n**Description:** System clock drifts from NTP server\n\n**What this means:** The system's internal clock is inaccurate and drifts significantly from the NTP server. This clock drift could impact application logic or authentication.\n\n**What to do:** Check the Network Time Protocol (NTP) service to ensure it's working correctly and the system can communicate with the designated time server. Verify the integrity of time synchronization services."
    },
    {
      "type": "markdown",
      "content": "### WindowsNodeHasRebooted\n\n**Description:** Windows node has rebooted\n\n**What this means:** The system has restarted, either as scheduled maintenance or unexpectedly due to system issues, updates, or power events.\n\n**What to do:** Track unexpected system restarts and correlate reboots with other system events or issues. Verify that scheduled maintenance reboots completed successfully."
    },
    {
      "type": "markdown",
      "content": "### WindowsServiceNotHealthy\n\n**Description:** Critical Windows service not running\n\n**What this means:** A specific service that's essential for system or application functionality has failed and isn't in a running state.\n\n**What to do:** Quickly identify and restart the failed critical service to reduce mean time to recovery (MTTR). Investigate and resolve the root cause to maintain uptime for essential business applications."
    },
    {
      "type": "markdown",
      "content": "**More to explore (optional)**\n\n- [Introduction to Grafana Alerting](/docs/grafana/latest/alerting)\n- [Create an alert rule](/docs/grafana/latest/alerting/alerting-rules/create-grafana-managed-rule)"
    }
  ]
}
