{
  "id": "mysql-integration-understand-dashboards",
  "title": "Understand MySQL dashboards",
  "blocks": [
    {
      "type": "markdown",
      "content": "The MySQL integration provides two pre-built dashboards that you can use immediately to begin monitoring and troubleshooting database performance issues. In this step of the journey, you'll become familiar with these pre-built dashboards and learn how to use them to address various problems.\n\nWhile this journey focuses on configuring the MySQL integration for one instance, the following dashboard images show the kinds of data you'll see when you monitor multiple MySQL instances across your infrastructure.\n\n> **Did you know?** If you don't see any metrics, try switching the data source using the drop-down at the top of the dashboard."
    },
    {
      "type": "markdown",
      "content": "## MySQL overview dashboard\n\nThis dashboard provides a comprehensive overview of your MySQL database performance and health, including:\n\n- **Connection metrics**: Active connections, connection rate, and connection errors\n- **Query performance**: Query rate, slow queries, and query execution statistics\n- **InnoDB buffer pool**: Buffer pool usage, hit ratio, and page statistics\n- **Replication status**: Replication lag, slave status, and synchronization health\n- **Resource utilization**: CPU usage, memory consumption, and disk I/O metrics\n\n**Use this dashboard to:**\n\n- Monitor overall database health and performance trends\n- Track connection usage and identify potential connection issues\n- Analyze query performance and identify slow operations\n- Monitor memory and storage utilization for capacity planning\n- Ensure replication consistency and performance"
    },
    {
      "type": "image",
      "src": "/media/integrations/mysql/screenshots/mysql.png",
      "alt": "MySQL overview dashboard showing database performance metrics"
    },
    {
      "type": "markdown",
      "content": "## MySQL logs dashboard\n\nThis dashboard focuses on log analysis and troubleshooting, including:\n\n- **Error patterns**: Monitor error frequencies and types\n- **Authentication events**: Track login failures and security events\n- **Slow query analysis**: Identify queries requiring performance optimization\n- **Database operations**: Monitor startup, shutdown, and maintenance events\n- **Audit information**: Review general query logs for compliance and debugging\n\n**Use this dashboard to:**\n\n- Troubleshoot database issues using log analysis\n- Monitor security events and authentication patterns\n- Identify performance bottlenecks through slow query analysis\n- Track database operational events and maintenance activities\n- Ensure compliance and audit trail requirements"
    },
    {
      "type": "image",
      "src": "/media/integrations/mysql/screenshots/mysql-logs.png",
      "alt": "MySQL logs dashboard showing log analysis and error tracking"
    },
    {
      "type": "markdown",
      "content": "In your final milestone, you'll complete the MySQL monitoring journey."
    },
    {
      "type": "markdown",
      "content": "**More to explore (optional)**\n\n- [Build a dashboard](/docs/grafana-cloud/visualizations/dashboards/build-dashboards)"
    },
    {
      "type": "markdown",
      "content": "**Troubleshooting**\n\nExplore the following troubleshooting topic if you need help:\n\n- [I don't see MySQL metrics in the dashboard](/docs/grafana-cloud/monitor-infrastructure/integrations/troubleshoot/)\n- [I don't see logs in the log dashboard](/docs/grafana-cloud/monitor-infrastructure/integrations/troubleshoot/install-troubleshoot-linux-alloy/#alloy-was-not-able-to-collect-your-application-logs)"
    }
  ]
}
