{
  "schemaVersion": "1.0.0",
  "id": "postgresql-integration-understand-dashboards",
  "title": "Understand PostgreSQL dashboards",
  "blocks": [
    {
      "type": "markdown",
      "content": "The PostgreSQL integration provides two pre-built dashboards that you can use immediately to begin monitoring and troubleshooting database performance issues. In this step of the journey, you'll become familiar with these pre-built dashboards and learn how to use them to address various problems.\n\nWhile this journey focuses on configuring the PostgreSQL integration for one instance, the following dashboard images show the kinds of data you'll see when you monitor multiple PostgreSQL instances across your infrastructure.\n\n**Did you know?** If you don't see any metrics, try switching the data source using the drop-down at the top of the dashboard.\n\n**PostgreSQL overview dashboard**\n\nThis dashboard provides a comprehensive overview of your PostgreSQL database performance and health, including:\n\n- Connection metrics: active connections, connection rate, and connection limits\n- Query performance: query rate, transactions per second, and database activity\n- Cache performance: buffer hit ratios and cache efficiency metrics\n- Database statistics: database size, tuple operations, and table statistics\n- Lock monitoring: lock acquisition, deadlocks, and contention analysis\n- Replication status: replication lag, standby status, and synchronization health\n\n**Use this dashboard to:**\n\n- Monitor overall database health and performance trends\n- Track connection usage and identify potential connection bottlenecks\n- Analyze cache performance and optimize buffer settings\n- Monitor database growth and plan capacity requirements\n- Identify lock contention and deadlock issues\n- Ensure replication consistency and performance\n\n**PostgreSQL logs dashboard**\n\nThis dashboard focuses on log analysis and troubleshooting, including:\n\n- Error patterns: monitor error frequencies and types\n- Authentication events: track connection attempts and security events\n- Query analysis: review query patterns and identify problematic operations\n- Database operations: monitor startup, shutdown, and maintenance events\n- Performance insights: analyze slow queries and resource-intensive operations\n\n**Use this dashboard to:**\n\n- Troubleshoot database issues using comprehensive log analysis\n- Monitor security events and authentication patterns\n- Identify performance bottlenecks through query analysis\n- Track database operational events and maintenance activities\n- Ensure security compliance and audit trail requirements\n\nIn your final milestone, you'll complete the PostgreSQL monitoring journey."
    },
    {
      "type": "markdown",
      "content": "## Troubleshooting\n\nExplore the following troubleshooting topics if you need help:\n\n- [I don't see PostgreSQL metrics in the dashboard](https://grafana.com/docs/grafana-cloud/monitor-infrastructure/integrations/troubleshoot/)\n- [I don't see logs in the log dashboard](https://grafana.com/docs/grafana-cloud/monitor-infrastructure/integrations/troubleshoot/install-troubleshoot-linux-alloy/#alloy-was-not-able-to-collect-your-application-logs)"
    }
  ]
}
